[
  {
    "path": "posts/2021-03-18-datavizmakeover-3/",
    "title": "DataViz Makeover 3",
    "description": "DataViz Makeover 3 provides a do-over for an existing data visualisation created to reveal the spatio-temporal patterns of armed conflict in selected South-east Asia countries.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-03-18",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Section A\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n1.3 Interactivity\r\n\r\n2.0 Section B\r\n3.0 Section C\r\n4.0 Section D\r\n5.0 Section E\r\n\r\n1.0 Section A\r\nCritique the interactive data visualisation from its clarity, aesthetics and interactivity. At least 2 from each evaluation criterion.\r\n1.1 Clarity\r\nS/N\r\nComments\r\nSuggested Improvements\r\nC1\r\nRegarding the points plotted on the map visual, it is not clear if it represents the number of events, or the number of fatalities.\r\nIndicate explicitly in the title of the map visual whether the data being visualized refers to number of events or fatalities.\r\nC2\r\nThe datapoints plotted on the map are of constant size, which does not provide much information on the scale or impact of the event.\r\nScale the size of the points by the value, whether it is the number of events or fatalities.\r\nC3\r\nWhile the various line plots help to denote the trend across the years, users are not able to gauge the breakdown of the scale of various events in relation to each other.\r\nTo plot the various event types on a single plot. This allows users to have a sense of which events are major and minor contributors across the time period.\r\n1.2 Aesthetics\r\nS/N\r\nComments\r\nSuggested Improvements\r\nA1\r\nFor the various data points on the map, it is unclear if that specific event had any fatalities or not.\r\nIntroduce point symbols, where a circle denotes an event without any fatalities, and a cross denotes the presence of fatalities for that recorded event.\r\nA2\r\nThere are no vertical gridlines present on the line plot. When more years are selected, this could make it tougher for the user to interpret the chart.\r\nAdd dotted vertical grid lines to aid the user in interpreting the chart, especially when making sense of the trend across many years.\r\nA3\r\n\r\nXXX\r\n1.3 Interactivity\r\nS/N\r\nComments\r\nSuggested Improvements\r\nI1\r\nXXX.\r\nXXX.\r\nI2\r\nXXX.\r\nXXX.\r\nI3\r\nXXX\r\nXXX\r\n2.0 Section B\r\nSuggest alternative data visualisation and interactive techniques to improve the current design.\r\n3.0 Section C\r\nUsing Tableau, design the proposed data visualization.\r\n4.0 Section D\r\nProvide step-by-step description on how the data visualization was prepared.\r\n5.0 Section E\r\nDescribe five major observations revealed by the data visualization prepared.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-18T17:43:13+08:00",
    "input_file": "datavizmakeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-15-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "DataViz Makeover 2 provides a do-over for the given charts from a research team working on Covid-19 vaccine responses data.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-02-15",
    "categories": [],
    "contents": "\r\n1.0 Section A\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nThese are the original data visualizations created by the research team conducting a study to understand the willingness of the public on Covid-19 vaccination.\r\n\r\nOriginal Graph Given\r\nClarity:\r\n1st chart shows a cumulative horizontal stacked bar chart. It is hard for users to perform comparisons across the countries due to the differing positions.\r\nThere are no value labels on the 1st chart, further making it hard for users to have a better idea of category responses across countries which may have bars with similar sizes\r\nThe data source utilized for this visualization was not made known. This makes is tough for users to do further exploration or fact-checking if needed.\r\nThe 1st chart seems to be sorted in alphabetical order, however the 2nd chart on the right is sorted by descending proportion of responses with “Strongly Agree”. This makes it possible confusing for users, especially when the 2nd chart was probably meant to provide a more specific view of the pro-vaccine sentiments of the various countries.\r\nKnowing the data source, there are actually multiple questions that were asked, and Vac 1 only provides a single narrow perspective as to various countries’ behaviour towards Covid-19 vaccines. This makes it hard for users to get a meaningful and balanced viewpoint.\r\nThere is a lack of breakdown of various population demographic fields such as gender, age, etc. Such fields could have provide meaningful and different narratives that are possibly actionable by governments or organizations.\r\n\r\nAesthetics:\r\nCountry names are in lower case and non-standardized. While not wrong, it is aesthetically not pleasing.\r\nThe actual contents of the survey question is not shown, instead it is left as “Vac 1”. It is hard for users to interpret the results in a meaningful way without understanding the background context.\r\nThe colors are seemingly random, as strong colors like red (which typically signify negativity) are used for a Neutral response, as opposed to Strongly Disagree responses.\r\n\r\n2.0 Section B\r\n\r\nDrawing of dashboard design\r\nAdvantages:\r\nA likert chart is created to provide a comparison where Negative sentiments are clearly on the left, and Positive sentiments are clearly on the right.\r\nThere is a reference line in the middle of the Neutral category, to make it easier for users to anchor to, and make sense of the values.\r\nThere are value labels on the 1st chart to further help users make sense of, and compare values between countries where the size of the bars could be quite similar.\r\nThe 2nd chart provides a 95% confidence interval band to help users have a better idea of how reliable the estimates of the responses are, as values are quoted in % format. (Some countries may have had lesser responses, yet have an overall higher proportion of Strongly Agree. It may be debatable as to how accurately it represents that particular demographic segment.)\r\nBoth charts have been sorted in descending order of Proportion of Strongly Agree sentiments for each Survey question. This standardization allows for better ease of comparison.\r\nA parameter with a drop-down list is provided for users to be able to see responses and trends for different questions. This provides users with more context, whether it be confidence in the vaccine, or fear of the disease, etc. This can provide a more well-rounded or balanced viewpoint.\r\nDemographic fields have been neatly grouped/ binned and are available for further filtering and analysis if required. This may reveal more interesting perspectives apart from a quick, high-level/ superficial interpretation based on the original charts.\r\n\r\n3.0 Section C\r\nUsing Tableau, design the proposed data visualization.\r\n\r\nFinal Tableau Dashboard\r\nThe final dashboard can be accessed here: https://public.tableau.com/profile/ng.wee.kien#!/vizhome/DVM2_submission_v2/DVM2Dashboard?publish=yes\r\n4.0 Section D\r\nProvide step-by-step description on how the data visualization was prepared.\r\n*Part 1: Bringing the data in + After downloading the data files, unzip the folders and ensure they are all in the same location. Drag the 1st file (“australia.csv”) into Tableau. Select the New Union function to import the chosen countries data using a manual connection. Note: Upon inspecting the raw data in excel, for ‘Sweden.csv’, column header ‘record’ had to be changed to ‘RecordNo’ to be consistent with the other data files.\r\n\r\nImporting data and performing a Union\r\nSelect all the columns that we do not want to use, right-click, and select Hide \r\n*Part 2: Creating a Likert Chart (Tableau)\r\nCreate calculated fields for the various survey question responses. The original data has 1 as Strongly Agree, 3 as Neutral, and 5 as Strongly Disagree. For ease of understanding to the general user, we will remap the scores in reverse order. The remapped score will have 1 as Strongly Disagree, 3 as Neutral, and 5 as Strongly Agree.\r\n\r\nCreating Remapped Scores for survey responsesCreating Remapped Scores for survey responses - Example for vac1_score\r\nCreate a Parameter: Survey Text. This is a String data type parameter. This is for users to choose which survey question to visualize and analyze. We will map the relevant display values as the respective survey text questions.\r\n\r\nCreating Parameter: Survey Text\r\nCreate a calculated field: Selected. This picks out what value the users chose in the Survey Text parameter, and the respective visualizations model those responses.\r\n\r\nCreating Parameter: Survey Text\r\nCreate a calculated field for Age Group\r\n\r\nCreating Age Group\r\nCreate a calculated field for Household Size Groups\r\n\r\nCreating Household Size Groups\r\nCreate calculated field: Number of records. This is just a constant value of 1.\r\nCreate calculated field: Total Count\r\n\r\nCreating Total Count\r\nCreate calculated field: Count Negative\r\n\r\nCreating Count Negative\r\nCreate calculated field: Total Count Negative\r\n\r\nCreating Total Count Negative\r\nCreate calculated field: Percentage\r\n\r\nCreating Percentage\r\nCreate calculated field: Gantt Start\r\n\r\nCreating Gantt Start\r\nCreate calculated field: Gantt Percent\r\n\r\nCreating Gantt Percent\r\nBring Country to Rows, and Gantt Percent to Columns\r\n\r\nSetting Rows and Columns\r\nChange Marks from Automatic to Gantt Bar\r\n\r\nChanging to Gantt Bar\r\nBring Selected to Colour and Detail, Percentage to Size and Label\r\n\r\nBringing Selected and Percentage to Marks settings\r\nBring Selected to Filters, and deselect Null values\r\n\r\nBringing Selected to Filters and removing null values\r\nEnsure that Percentage (Size and Label), and Gantt Percent are toggled to compute using Selected.\r\n\r\nCompute using Selected\r\nChange view from Standard to Entire View\r\nEdit title of Legend (“Selected”) to “Responses”\r\nRight click on Survey Text Parameter and select Show Parameter\r\nAdd Reference Line to X axis of Likert chart by right clicking on the X axis. Change the settings to picture shown below.\r\n\r\nAdd Reference Line to X axis\r\nChange format of X axis to percentage with 0 decimal points\r\n\r\nChange format of X axis to percentage\r\nChange format of Percentage field to 1 decimal point\r\nChange title of X axis to “Survey Responses as Proportion of Total Responses”\r\nChange Label settings to align to middle and make font size smaller\r\n\r\nChange format of Label settings\r\n*Part 3: Creating Confidence Interval Error Bar charts\r\nCreate a calculated field for Strongly Agree Single Count. We are creating counts for responses with “Strongly Agree”.\r\n\r\nCreate calculated field for Strongly Agree Single Count\r\nCreate a calculated field for Prop. We want to find out the proportion of responses which gave “Strongly Agree”.\r\n\r\nCreate calculated field Prop\r\nGo back to the Likert chart, and sort Country (rows) by Prop under Field. This allows us to sort in descending order for countries with highest to lowest proportions of responses with “Strongly Agree”.\r\n\r\nSort Country in Likert Chart by Prop\r\nCreate calculated field for Prop SE\r\n\r\nCreate calculated field PropSE\r\nCreate calculated field for Z_95%. It has a constant value of “1.959964”.\r\nCreate calculated field for Prop_Margin of Error 95%\r\n\r\nCreate calculated field Prop Margin of Error 95%\r\nCreate calculated field for Prop_Lower Limit 95%\r\n\r\nCreate calculated field Prop Lower Limit 95%\r\nCreate calculated field for Prop_Upper Limit 95%\r\n\r\nCreate calculated field Prop Upper Limit 95%\r\nMove Country to Rows, Prop to Columns\r\nChange Mark for Props from Automatic (line) to Circle\r\nMove Measure Values to upper secondary horizontal axis\r\n\r\nMove Measure Values to upper horizontal axis\r\nEdit the filter for Measure Names, and keep only 2 measures: Prop_Lower Limit 95% and Prop_Upper Limit 95%.\r\n\r\nAdd Measure Values, keep only Upper and Lower limit 95%\r\nMove Selected to Filters, and uncheck ‘Null’ values.\r\nChange Measure Values from Circle to Line. Press Ctrl+Click and drag measure values to Path and repeat the same to Colour.\r\n\r\nChange from circle to line, add Measure Names to other roles.\r\nRight click on the X axis with a smaller range of values, and select Synchronize axis\r\n\r\nSynchronize horizontal axis\r\nUnder AGG(Prop) mark, change Measure Names from Detail to Colour.\r\nChange colors of Measure Names (on right side) as required\r\n\r\nChange colors of Measure Names\r\nUnder columns, change the order of Measure Values and AGG(Prop). This allows AGG(Prop) Circle to appear ‘in front of’ Measure Values Line.\r\nChange the format of both X-axis to percentage, with 0 decimal points.\r\nChange the view from Standard to Entire View\r\nUnder Rows, Country, Sort by Field > Prop in descending manner. (similar to the Likert Chart)\r\nTurn on Animations, and change settings as desired.\r\n\r\nTurn on, and change Animation settings\r\nRight click on the upper horizontal axis, and uncheck Show Header.\r\n\r\nUncheck upper horizontal axis header\r\nEdit the lower horizontal axis title to “Proportion of”Strongly Agree\" responses (with 95% CI bands)\"\r\nRight click on Country on the vertical axis, and change the font color to black, font size to 9, and Alignment to Centre.\r\nRight click on Parameter Survey Text, and select Show Parameter.\r\n*Part 4: Creating the dashboard\r\n\r\nCreating the Dashboard\r\nToggle the size of the dashboard to Automatic\r\n\r\nDrag in the Likert Chart, change the legend to floating, and resize accordingly as a single row above the chart.\r\n\r\nDrag in the Confidence Interval Error Bar Chart\r\n\r\nAdd the relevant filters for demographics into the dashboard\r\n\r\n\r\nExpose filters on the dashboard\r\nAdd a text box on the top left, adjust the contents as shown.\r\n\r\n\r\nAdd text boxes\r\nExpose the Survey Text parameter and place it on the top right of the dashboard.\r\n\r\nAdd Blank objects around the dashboard to resize the layout accordingly.\r\n\r\nAdd text boxes at the bottom to cite the data source and link.\r\n\r\n*Part 6: Going live + Publish the final dashboard to Tableau Public Server.\r\n5.0 Section E\r\nDescribe three major observations revealed by the data visualization prepared.\r\n1st insight:\r\nFor the question: I am worried about getting Covid-19, Japan holds the top spot for highest proportion of “Strongly Agree” responses. Meanwhile, an European country like France is somewhere in the middle of the table. South Korea comes in at the 2nd spot. This observation holds true regardless of Gender. One might infer that certain Asian countries might be more concerned about contracting the Virus than certain European countries.\r\n2nd insight:\r\nFor the question: I am worried about potential side effects of a COVID19 vaccine, France had the highest proportion of “Strongly Agree” responses at 44%, with Japan coming in next at 35%. However, when selecting only the Female gender, France was at 53% with Japan coming in at 40%. We can see that the gap was widened. In addition, the gap was narrowed when looking at only Males, with France at 33% and Japan at 30%. Another thing to note is that there was greater variance in the proportion for Males. Put all together, one might infer that people in France and Japan both have the highest proportions of people who feel strongly about the potential side effects of the vaccine. In addition, females in both an European country like France and a ‘traditional’ and ‘conservative’ Asian country like Japan feel more strongly about it than their Male counterparts. This could point to Females being more risk averse than Males for the risk of potential side effects from a Covid-19 vaccine.\r\nPut together with the 1st insight, it seems that a country like France is not too concerned with contracting the virus, and also is wary of potential side effects of the Vaccine. This might give some indication to their willingness to be vaccinated (not very willing). This is juxtaposed with Japan, where they rank highly on being worried about Covid-19, AND they also rank highly on worrying about potential side effects of a vaccine (albeit more towards the female gender). It remains to be seen if responders in Japan would be willing to take the vaccine in the near-term.\r\n3rd insight:\r\nFor the question: If a Covid-19 vaccine were made available to me this week, I would definitely get it, Japan ranked last at 18% and France was 3rd last at 22%. This indicates that in the short term, both countries are less willing to take a vaccine.\r\nFor the question: If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it, Japan still ranked last at 25%, and France was 5th last at 35%. This indicates that although in general both the proportion in both countries have become more willing to take a future vaccine, compared to other countries, they are still relatively unwilling to do so.\r\nLastly, for the question: I believe government health authorities in my country will provide me with an effective COVID19 vaccine, Japan is again, still ranked last at 15%, and France is 2nd last at 19%. Both countries have low confidence in their government’s ability to provide them with an effective Covid-19 vaccine.\r\nPutting all the insights and observations together, it seems that even for countries like Japan where they are very worried about Covid-19, they might be unwilling to take a vaccine, even if it were available (both in the short term, and even in the long term where more results and proof may be available). One may also infer that this may be due to the low confidence in the respective governments ability to provide them with an effective (and possibly safe) vaccine. To a certain extent, France shows a similar trend.\r\nIt may make some sense for governments worldwide to consider re-assuring their citizens on their capabilities to procure a SAFE and effective vaccine, if a higher vaccine adoption rate is a key objective. Similarly, companies may also consider such trends in their product manufacturing strategies in the coming months/ years.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T23:02:57+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T22:06:58+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-26-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-26T23:14:54+08:00",
    "input_file": "my-first-post.utf8.md"
  },
  {
    "path": "posts/2021-01-26-DataVizMakeover1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 provides a do-over for the given chart from the Ministry of Manpower on Singapore's resident labour force.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Section A\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nInitial ChartClarity:\r\nWhile the visualization provides the breakdown of age group in bins of 5 years, the lead-in verbiage mentions summary statistics using a different age bin.\r\nStatistics provided in the lead-in verbiage are hard for readers to match to what the graph shows. Readers are forced to do separate calculations and their own set of data binning (on the x-axis variable) to achieve those claims. For example, the claim of ‘share of residents aged 55 & over..’ requires the reader to manually sum up the values across 4 categories to validate that claim, and such a change in trend is also not clear from the line graph.\r\nLack of Y-axis makes it harder to interpret line graph. Readers are forced to refer down to table at bottom to see the values.\r\n\r\nAesthetics:\r\nAs the X-axis is of a categorical data type, a bar chart would be more appropriate. Whereas, the line chart will be more suited for a time-series form of comparison.\r\nX-axis labels could be placed on the tick marks to make it easier to read.\r\nHard to relate to the underlying message of the differences in ‘older’ age group (55&over) vs ‘middle’ age group (25-54).\r\n\r\n2.0 Section B\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nInitial SketchAdvantages:\r\nBy re-categorizing the age bins, it is easier to make sense of, and differentiate between the trends for the young/middle/old age groups. The usage of the icons further help make it clearer of the meaning of the various age groups.\r\nBoth side-by-side bar charts share the same X-axis/panes, making the visualization look cleaner.\r\nIn addition, bar charts are used instead of the original line graph. This makes it easier to compare such categorical data.\r\nFigures quoted in the lead-in paragraph can be found within the visualization itself, making it easier for the reader to follow the message.\r\nThe Y-axis is clearly shown and labelled, with gridlines present. In addition, value labels are also present.\r\n\r\n3.0 Section C\r\nUsing Tableau, design the proposed data visualization.\r\nThe final dashboard can be accessed here: https://public.tableau.com/profile/ng.wee.kien#!/vizhome/DVM1_submission/Dashboard1?publish=yes\r\nFinal Tableau Dashboard4.0 Section D\r\nProvide step-by-step description on how the data visualization was prepared.\r\nStep 1: Preparing data in excel \r\n3 new age bins were created from the given age bins of 5 years each. They are: ‘15-24’, ‘25-54’, and ‘55&over’.\r\nData from table 7 and table 5 in the MOM website was compiled into different columns within this same table.\r\nThe values from table 7 were changed back to the full values, instead of being represented in thousands.\r\nThe values from table 5 were changed into decimal numbers, instead of the percentage points given.\r\n\r\nStep 2: Excel data was imported into Tableau by dragging the excel workbook from file explorer into the Tableau user interface. The relevant tab within the excel workbook was selected. Default data types of text for Age Bins and numeric for the labour force figures were acceptable.\r\nStep 3: Creating the 1st chart (Share of Residents Labour Force)\r\nAn age Heirarchy was created, with Age Bin (Years) being above Age (Years)\r\nThe age Heirarchy was placed in Columns\r\nThe measures “09 Total T7 K” and “19 Total T7 K” were placed in Rows\r\nIn the top right, under ‘Show Me’, a side-by-side bar chart was chosen.\r\nView was changed to ‘Entire View’, from ‘Standard’.\r\nTitle was changed to “Residents Labour Force by Age Bin”, bolded, and font size increased.\r\nY-axis title was changed to “Share of Resident Labour Force (%)”\r\nUnder ‘Analysis’ > ‘Percentage Of’ > ‘Table’\r\nRight click on Y-axis, Format, change Scale>Numbers to Percentage with 0 decimal places.\r\nRight click on X-axis, uncheck ‘Show header’\r\nRight click on the various bars and select ‘Mark Label’ > ‘Always Show’\r\nFor both measures under the Measure Values pane, select the drop down list > ‘Format’, and change Numbers formatting to Percentage with 0 decimal places.\r\nOn the top right, legend aliases were edited to ‘2009/2019 Resident Labour Force’ respectively. Legend title was changed from ‘Measure Names’ to ‘Legend’\r\n\r\nStep 4: Creating the 2nd chart (Labour Force Participation Rate)\r\nAn age Heirarchy was created, with Age Bin (Years) being above Age (Years)\r\nThe age Heirarchy was placed in Columns\r\nThe measures “09 Total T5 Pct” and “19 Total T5 Pct” were placed in Rows\r\nIn the top right, under ‘Show Me’, a side-by-side bar chart was chosen.\r\nView was changed to ‘Entire View’, from ‘Standard’.\r\nTitle was changed to “Labour Force Participation Rate”, bolded, and font size increased.\r\nY-axis title was changed to “Labour Force Participation Rate (%)”\r\nUnder Measure Values, for both measures, Measures were changed from Sum to Average.\r\nRight click on Y-axis, Format, change Scale>Numbers to Percentage with 0 decimal places.\r\nRight click on X-axis, uncheck ‘Show header’\r\nRight click on the various bars and select ‘Mark Label’ > ‘Always Show’\r\nFor both measures under the Measure Values pane, select the drop down list > ‘Format’, and change Numbers formatting to Percentage with 0 decimal places.\r\nOn the top right, legend aliases were edited to ‘2009/2019 Resident Labour Force’ respectively. Legend title was changed from ‘Measure Names’ to ‘Legend’\r\nRight click the Y-axis > ‘Edit Axis’ > ‘Scale’ > Check the ‘Reversed’ checkbox.\r\n\r\nStep 5: Creating the dashboard\r\nDrag the 1st sheet ‘% Share Labor Force Age Bin’ onto the dashboard\r\nDrag the 2nd sheet ‘LFPR’ onto the dashboard (below the 1st one)\r\nAdd a text box at the top, fill in lead-in verbiage\r\nRight click on legend in the top right, and select ‘Floating’. Drag to correct position.\r\nAdd 3 Image boxes between the 1st and the 2nd chart. Resize accordingly. Right click > ‘Edit Image’ and select all 3 images respectively.\r\nAdd a Blank on the left of the 1st image for padding.\r\nAdd 2 text boxes at the bottom to provide references for images and data used\r\n\r\nStep 6: Save and Publish to Tableau Public server\r\n5.0 Section E\r\nDescribe three major observations revealed by the data visualisation prepared.\r\nThere is a decrease in the share of resident labour force for the middle age bin (25-54 years), even though the labour force participation rate for this category increased, comparing 2009 and 2019. This means that a greater proportion of those in this age group are working, however as the absolute number for this age group has decreased, it contributes to a smaller base for the entire population’s labour force as a whole.\r\nOn the other hand, with the increase in numbers for the older age group (55&over), the share of resident labour force for this category has increased. This was also due to more older people choosing to continue to work. (This may possibly be due to an increased retirement age, rising cost of living, or a whole host of other factors.)\r\nThere was a slight decrease in the share of resident labour force for the youngest age group (15-24 years). This could be due to a few factors:\r\nLesser children per family (and the nation as a whole)\r\nChildren are more well supported by their families, are able to have further education, and start work later\r\nOther factors\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T14:59:47+08:00",
    "input_file": "datavizmakeover_1.utf8.md"
  }
]
