[
  {
    "path": "posts/2021-02-15-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "DataViz Makeover 2 provides a do-over for the given charts from a research team working on Covid-19 vaccine responses data.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-02-15",
    "categories": [],
    "contents": "\r\n1.0 Section A\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nClarity:\r\nAesthetics:\r\n2.0 Section B\r\nAdvantages:\r\n3.0 Section C\r\nUsing Tableau, design the proposed data visualization.\r\nThe final dashboard can be accessed here: TO ADD TABLEAU PUBLIC LINK HERE!\r\n4.0 Section D\r\nProvide step-by-step description on how the data visualization was prepared.\r\n*Part 1: Bringing the data in + After downloading the data files, unzip the folders and ensure they are all in the same location. Drag the 1st file (“australia.csv”) into Tableau. Select the New Union function to import the chosen countries data using a manual connection. Note: Upon inspecting the raw data in excel, for ‘Sweden.csv’, column header ‘record’ had to be changed to ‘RecordNo’ to be consistent with the other data files. \r\nSelect all the columns that we do not want to use, right-click, and select Hide \r\n*Part 2: Creating a Likert Chart (Tableau)\r\nCreate calculated fields for the various survey question responses. The original data has 1 as Strongly Agree, 3 as Neutral, and 5 as Strongly Disagree. For ease of understanding to the general user, we will remap the scores in reverse order. The remapped score will have 1 as Strongly Disagree, 3 as Neutral, and 5 as Strongly Agree. \r\nCreate a Parameter: Survey Text. This is a String data type parameter. This is for users to choose which survey question to visualize and analyze. We will map the relevant display values as the respective survey text questions. \r\nCreate a calculated field: Selected. This picks out what value the users chose in the Survey Text parameter, and the respective visualizations model those responses. \r\nCreate a calculated field for Age Group \r\nCreate a calculated field for Household Size Groups \r\nCreate calculated field: Number of records. This is just a constant value of 1.\r\nCreate calculated field: Total Count \r\nCreate calculated field: Count Negative \r\nCreate calculated field: Total Count Negative \r\nCreate calculated field: Percentage \r\nCreate calculated field: Gantt Start \r\nCreate calculated field: Gantt Percent \r\nBring Country to Rows, and Gantt Percent to Columns \r\nChange Marks from Automatic to Gantt Bar \r\nBring Selected to Colour and Detail, Percentage to Size and Label \r\nBring Selected to Filters, and deselect Null values \r\nEnsure that Percentage (Size and Label), and Gantt Percent are toggled to compute using Selected. \r\nChange view from Standard to Entire View\r\nEdit title of Legend (“Selected”) to “Responses”\r\nRight click on Survey Text Parameter and select Show Parameter\r\nAdd Reference Line to X axis of Likert chart by right clicking on the X axis. Change the settings to picture shown below. \r\nChange format of X axis to percentage with 0 decimal points \r\nChange format of Percentage field to 1 decimal point \r\nChange title of X axis to “Survey Responses as Proportion of Total Responses”\r\nChange Label settings to align to middle and make font size smaller \r\n*Part 3: Creating Confidence Interval Error Bar charts\r\nCreate a calculated field for Strongly Agree Single Count. We are creating counts for responses with “Strongly Agree”. CI_stronglyagreesinglecount.jpg\r\nCreate a calculated field for Prop. We want to find out the proportion of responses which gave “Strongly Agree”. CI_prop.jpg\r\nGo back to the Likert chart, and sort Country (rows) by Prop under Field. This allows us to sort in descending order for countries with highest to lowest proportions of responses with “Strongly Agree”. likert_sort_country_prop.jpg\r\nCreate calculated field for Prop SE\r\nCreate calculated field for Z_95%\r\nCreate calculated field for Prop_Margin of Error 95%\r\nCreate calculated field for Prop_Lower Limit 95%\r\nCreate calculated field for Prop_Upper Limit 95%\r\nMove Country to Rows, Prop to Columns\r\nChange Mark for Props from Automatic (line) to Circle\r\nMove Measure Values to upper secondary horizontal axis CI_measurevalues_upper_axis.jpg\r\nEdit the filter for Measure Names, and keep only 2 measures: Prop_Lower Limit 95% and Prop_Upper Limit 95%. CI_keep_only2measurenames.jpg\r\nMove Selected to Filters, and uncheck ‘Null’ values.\r\n\r\n5.0 Section E\r\nDescribe three major observations revealed by the data visualization prepared.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-18T13:54:07+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to IDEA",
    "description": "Welcome to our new blog, IDEA. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T22:06:58+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-26-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-26T23:14:54+08:00",
    "input_file": "my-first-post.utf8.md"
  },
  {
    "path": "posts/2021-01-26-DataVizMakeover1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 provides a do-over for the given chart from the Ministry of Manpower on Singapore's resident labour force.",
    "author": [
      {
        "name": "Ng Wee Kien (Vincent)",
        "url": "https://www.linkedin.com/in/ngweekiensg/"
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\n1.0 Section A\r\nCritic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nInitial ChartClarity:\r\nWhile the visualization provides the breakdown of age group in bins of 5 years, the lead-in verbiage mentions summary statistics using a different age bin.\r\nStatistics provided in the lead-in verbiage are hard for readers to match to what the graph shows. Readers are forced to do separate calculations and their own set of data binning (on the x-axis variable) to achieve those claims. For example, the claim of ‘share of residents aged 55 & over..’ requires the reader to manually sum up the values across 4 categories to validate that claim, and such a change in trend is also not clear from the line graph.\r\nLack of Y-axis makes it harder to interpret line graph. Readers are forced to refer down to table at bottom to see the values.\r\n\r\nAesthetics:\r\nAs the X-axis is of a categorical data type, a bar chart would be more appropriate. Whereas, the line chart will be more suited for a time-series form of comparison.\r\nX-axis labels could be placed on the tick marks to make it easier to read.\r\nHard to relate to the underlying message of the differences in ‘older’ age group (55&over) vs ‘middle’ age group (25-54).\r\n\r\n2.0 Section B\r\nWith reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nInitial SketchAdvantages:\r\nBy re-categorizing the age bins, it is easier to make sense of, and differentiate between the trends for the young/middle/old age groups. The usage of the icons further help make it clearer of the meaning of the various age groups.\r\nBoth side-by-side bar charts share the same X-axis/panes, making the visualization look cleaner.\r\nIn addition, bar charts are used instead of the original line graph. This makes it easier to compare such categorical data.\r\nFigures quoted in the lead-in paragraph can be found within the visualization itself, making it easier for the reader to follow the message.\r\nThe Y-axis is clearly shown and labelled, with gridlines present. In addition, value labels are also present.\r\n\r\n3.0 Section C\r\nUsing Tableau, design the proposed data visualization.\r\nThe final dashboard can be accessed here: https://public.tableau.com/profile/ng.wee.kien#!/vizhome/DVM1_submission/Dashboard1?publish=yes\r\nFinal Tableau Dashboard4.0 Section D\r\nProvide step-by-step description on how the data visualization was prepared.\r\nStep 1: Preparing data in excel \r\n3 new age bins were created from the given age bins of 5 years each. They are: ‘15-24’, ‘25-54’, and ‘55&over’.\r\nData from table 7 and table 5 in the MOM website was compiled into different columns within this same table.\r\nThe values from table 7 were changed back to the full values, instead of being represented in thousands.\r\nThe values from table 5 were changed into decimal numbers, instead of the percentage points given.\r\n\r\nStep 2: Excel data was imported into Tableau by dragging the excel workbook from file explorer into the Tableau user interface. The relevant tab within the excel workbook was selected. Default data types of text for Age Bins and numeric for the labour force figures were acceptable.\r\nStep 3: Creating the 1st chart (Share of Residents Labour Force)\r\nAn age Heirarchy was created, with Age Bin (Years) being above Age (Years)\r\nThe age Heirarchy was placed in Columns\r\nThe measures “09 Total T7 K” and “19 Total T7 K” were placed in Rows\r\nIn the top right, under ‘Show Me’, a side-by-side bar chart was chosen.\r\nView was changed to ‘Entire View’, from ‘Standard’.\r\nTitle was changed to “Residents Labour Force by Age Bin”, bolded, and font size increased.\r\nY-axis title was changed to “Share of Resident Labour Force (%)”\r\nUnder ‘Analysis’ > ‘Percentage Of’ > ‘Table’\r\nRight click on Y-axis, Format, change Scale>Numbers to Percentage with 0 decimal places.\r\nRight click on X-axis, uncheck ‘Show header’\r\nRight click on the various bars and select ‘Mark Label’ > ‘Always Show’\r\nFor both measures under the Measure Values pane, select the drop down list > ‘Format’, and change Numbers formatting to Percentage with 0 decimal places.\r\nOn the top right, legend aliases were edited to ‘2009/2019 Resident Labour Force’ respectively. Legend title was changed from ‘Measure Names’ to ‘Legend’\r\n\r\nStep 4: Creating the 2nd chart (Labour Force Participation Rate)\r\nAn age Heirarchy was created, with Age Bin (Years) being above Age (Years)\r\nThe age Heirarchy was placed in Columns\r\nThe measures “09 Total T5 Pct” and “19 Total T5 Pct” were placed in Rows\r\nIn the top right, under ‘Show Me’, a side-by-side bar chart was chosen.\r\nView was changed to ‘Entire View’, from ‘Standard’.\r\nTitle was changed to “Labour Force Participation Rate”, bolded, and font size increased.\r\nY-axis title was changed to “Labour Force Participation Rate (%)”\r\nUnder Measure Values, for both measures, Measures were changed from Sum to Average.\r\nRight click on Y-axis, Format, change Scale>Numbers to Percentage with 0 decimal places.\r\nRight click on X-axis, uncheck ‘Show header’\r\nRight click on the various bars and select ‘Mark Label’ > ‘Always Show’\r\nFor both measures under the Measure Values pane, select the drop down list > ‘Format’, and change Numbers formatting to Percentage with 0 decimal places.\r\nOn the top right, legend aliases were edited to ‘2009/2019 Resident Labour Force’ respectively. Legend title was changed from ‘Measure Names’ to ‘Legend’\r\nRight click the Y-axis > ‘Edit Axis’ > ‘Scale’ > Check the ‘Reversed’ checkbox.\r\n\r\nStep 5: Creating the dashboard\r\nDrag the 1st sheet ‘% Share Labor Force Age Bin’ onto the dashboard\r\nDrag the 2nd sheet ‘LFPR’ onto the dashboard (below the 1st one)\r\nAdd a text box at the top, fill in lead-in verbiage\r\nRight click on legend in the top right, and select ‘Floating’. Drag to correct position.\r\nAdd 3 Image boxes between the 1st and the 2nd chart. Resize accordingly. Right click > ‘Edit Image’ and select all 3 images respectively.\r\nAdd a Blank on the left of the 1st image for padding.\r\nAdd 2 text boxes at the bottom to provide references for images and data used\r\n\r\nStep 6: Save and Publish to Tableau Public server\r\n5.0 Section E\r\nDescribe three major observations revealed by the data visualisation prepared.\r\nThere is a decrease in the share of resident labour force for the middle age bin (25-54 years), even though the labour force participation rate for this category increased, comparing 2009 and 2019. This means that a greater proportion of those in this age group are working, however as the absolute number for this age group has decreased, it contributes to a smaller base for the entire population’s labour force as a whole.\r\nOn the other hand, with the increase in numbers for the older age group (55&over), the share of resident labour force for this category has increased. This was also due to more older people choosing to continue to work. (This may possibly be due to an increased retirement age, rising cost of living, or a whole host of other factors.)\r\nThere was a slight decrease in the share of resident labour force for the youngest age group (15-24 years). This could be due to a few factors:\r\nLesser children per family (and the nation as a whole)\r\nChildren are more well supported by their families, are able to have further education, and start work later\r\nOther factors\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T14:59:47+08:00",
    "input_file": "datavizmakeover_1.utf8.md"
  }
]
